app/controllers/admin_controller.rb

SELECT * FROM `pages`
SELECT * FROM `workshops` WHERE (start_date >= '2009-11-24') ORDER BY start_date DESC LIMIT 0, 10
---
  def index
    params[:page] = params[:page] || 1
    params[:tense] = params[:tense] || 'future'
    if params[:tense] and params[:tense] == 'past'
      @workshops = Workshop.paginate :page => params[:page], :conditions => [ 'start_date < ?', Date.today ], :order => "start_date DESC"