app/controllers/upcoming_controller.rb

  def view
    @admin = session[:admin]
    if session[:admin]
      @workshops = Workshop.find(:all,
        :conditions => [ "cutoff_date >= ?", Date.today ],
        :order => "start_date ASC" )
---
SELECT * FROM `workshops` WHERE (cutoff_date >= '2009-11-24' and active = 1) ORDER BY start_date ASC